veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 14, Error Tracking Register 1 */
#define MTU_MC0_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061014u)

/** \brief 16, Error Tracking Register 2 */
#define MTU_MC0_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061016u)

/** \brief 18, Error Tracking Register 3 */
#define MTU_MC0_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061018u)

/** \brief 1A, Error Tracking Register 4 */
#define MTU_MC0_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006101Au)

/** \brief 60, Read Data and Bit Flip Register 0 */
#define MTU_MC0_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061060u)

/** \brief 62, Read Data and Bit Flip Register 1 */
#define MTU_MC0_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061062u)

/** \brief 64, Read Data and Bit Flip Register 2 */
#define MTU_MC0_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061064u)

/** \brief 66, Read Data and Bit Flip Register 3 */
#define MTU_MC0_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061066u)

/** \brief 68, Read Data and Bit Flip Register 4 */
#define MTU_MC0_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061068u)

/** \brief 6A, Read Data and Bit Flip Register 5 */
#define MTU_MC0_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Au)

/** \brief 6C, Read Data and Bit Flip Register 6 */
#define MTU_MC0_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Cu)

/** \brief 6E, Read Data and Bit Flip Register 7 */
#define MTU_MC0_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006106Eu)

/** \brief 70, Read Data and Bit Flip Register 8 */
#define MTU_MC0_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061070u)

/** \brief 72, Read Data and Bit Flip Register 9 */
#define MTU_MC0_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061072u)

/** \brief 74, Read Data and Bit Flip Register 10 */
#define MTU_MC0_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061074u)

/** \brief 76, Read Data and Bit Flip Register 11 */
#define MTU_MC0_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061076u)

/** \brief 78, Read Data and Bit Flip Register 12 */
#define MTU_MC0_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061078u)

/** \brief 7A, Read Data and Bit Flip Register 13 */
#define MTU_MC0_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Au)

/** \brief 7C, Read Data and Bit Flip Register 14 */
#define MTU_MC0_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Cu)

/** \brief 7E, Read Data and Bit Flip Register 15 */
#define MTU_MC0_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006107Eu)

/** \brief 80, Read Data and Bit Flip Register 16 */
#define MTU_MC0_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061080u)

/** \brief 82, Read Data and Bit Flip Register 17 */
#define MTU_MC0_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061082u)

/** \brief 84, Read Data and Bit Flip Register 18 */
#define MTU_MC0_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061084u)

/** \brief 86, Read Data and Bit Flip Register 19 */
#define MTU_MC0_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061086u)

/** \brief 88, Read Data and Bit Flip Register 20 */
#define MTU_MC0_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061088u)

/** \brief 8A, Read Data and Bit Flip Register 21 */
#define MTU_MC0_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Au)

/** \brief 8C, Read Data and Bit Flip Register 22 */
#define MTU_MC0_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Cu)

/** \brief 8E, Read Data and Bit Flip Register 23 */
#define MTU_MC0_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006108Eu)

/** \brief 90, Read Data and Bit Flip Register 24 */
#define MTU_MC0_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061090u)

/** \brief 92, Read Data and Bit Flip Register 25 */
#define MTU_MC0_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061092u)

/** \brief 94, Read Data and Bit Flip Register 26 */
#define MTU_MC0_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061094u)

/** \brief 96, Read Data and Bit Flip Register 27 */
#define MTU_MC0_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061096u)

/** \brief 98, Read Data and Bit Flip Register 28 */
#define MTU_MC0_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061098u)

/** \brief 9A, Read Data and Bit Flip Register 29 */
#define MTU_MC0_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Au)

/** \brief 9C, Read Data and Bit Flip Register 30 */
#define MTU_MC0_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Cu)

/** \brief 9E, Read Data and Bit Flip Register 31 */
#define MTU_MC0_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006109Eu)

/** \brief A0, Read Data and Bit Flip Register 32 */
#define MTU_MC0_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A0u)

/** \brief A2, Read Data and Bit Flip Register 33 */
#define MTU_MC0_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A2u)

/** \brief A4, Read Data and Bit Flip Register 34 */
#define MTU_MC0_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A4u)

/** \brief A6, Read Data and Bit Flip Register 35 */
#define MTU_MC0_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A6u)

/** \brief A8, Read Data and Bit Flip Register 36 */
#define MTU_MC0_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610A8u)

/** \brief AA, Read Data and Bit Flip Register 37 */
#define MTU_MC0_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610AAu)

