veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 766, Read Data and Bit Flip Register 3 */
#define MTU_MC7_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061766u)

/** \brief 768, Read Data and Bit Flip Register 4 */
#define MTU_MC7_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061768u)

/** \brief 76A, Read Data and Bit Flip Register 5 */
#define MTU_MC7_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Au)

/** \brief 76C, Read Data and Bit Flip Register 6 */
#define MTU_MC7_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Cu)

/** \brief 76E, Read Data and Bit Flip Register 7 */
#define MTU_MC7_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Eu)

/** \brief 770, Read Data and Bit Flip Register 8 */
#define MTU_MC7_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061770u)

/** \brief 772, Read Data and Bit Flip Register 9 */
#define MTU_MC7_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061772u)

/** \brief 774, Read Data and Bit Flip Register 10 */
#define MTU_MC7_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061774u)

/** \brief 776, Read Data and Bit Flip Register 11 */
#define MTU_MC7_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061776u)

/** \brief 778, Read Data and Bit Flip Register 12 */
#define MTU_MC7_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061778u)

/** \brief 77A, Read Data and Bit Flip Register 13 */
#define MTU_MC7_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Au)

/** \brief 77C, Read Data and Bit Flip Register 14 */
#define MTU_MC7_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Cu)

/** \brief 77E, Read Data and Bit Flip Register 15 */
#define MTU_MC7_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Eu)

/** \brief 780, Read Data and Bit Flip Register 16 */
#define MTU_MC7_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061780u)

/** \brief 782, Read Data and Bit Flip Register 17 */
#define MTU_MC7_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061782u)

/** \brief 784, Read Data and Bit Flip Register 18 */
#define MTU_MC7_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061784u)

/** \brief 786, Read Data and Bit Flip Register 19 */
#define MTU_MC7_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061786u)

/** \brief 788, Read Data and Bit Flip Register 20 */
#define MTU_MC7_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061788u)

/** \brief 78A, Read Data and Bit Flip Register 21 */
#define MTU_MC7_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Au)

/** \brief 78C, Read Data and Bit Flip Register 22 */
#define MTU_MC7_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Cu)

/** \brief 78E, Read Data and Bit Flip Register 23 */
#define MTU_MC7_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Eu)

/** \brief 790, Read Data and Bit Flip Register 24 */
#define MTU_MC7_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061790u)

/** \brief 792, Read Data and Bit Flip Register 25 */
#define MTU_MC7_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061792u)

/** \brief 794, Read Data and Bit Flip Register 26 */
#define MTU_MC7_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061794u)

/** \brief 796, Read Data and Bit Flip Register 27 */
#define MTU_MC7_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061796u)

/** \brief 798, Read Data and Bit Flip Register 28 */
#define MTU_MC7_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061798u)

/** \brief 79A, Read Data and Bit Flip Register 29 */
#define MTU_MC7_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Au)

/** \brief 79C, Read Data and Bit Flip Register 30 */
#define MTU_MC7_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Cu)

/** \brief 79E, Read Data and Bit Flip Register 31 */
#define MTU_MC7_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Eu)

/** \brief 7A0, Read Data and Bit Flip Register 32 */
#define MTU_MC7_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A0u)

/** \brief 7A2, Read Data and Bit Flip Register 33 */
#define MTU_MC7_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A2u)

/** \brief 7A4, Read Data and Bit Flip Register 34 */
#define MTU_MC7_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A4u)

/** \brief 7A6, Read Data and Bit Flip Register 35 */
#define MTU_MC7_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A6u)

/** \brief 7A8, Read Data and Bit Flip Register 36 */
#define MTU_MC7_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A8u)

/** \brief 7AA, Read Data and Bit Flip Register 37 */
#define MTU_MC7_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AAu)

/** \brief 7AC, Read Data and Bit Flip Register 38 */
#define MTU_MC7_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617ACu)

/** \brief 7AE, Read Data and Bit Flip Register 39 */
#define MTU_MC7_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AEu)

/** \brief 7B0, Read Data and Bit Flip Register 40 */
#define MTU_MC7_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B0u)

/** \brief 7B2, Read Data and Bit Flip Register 41 */
#define MTU_MC7_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B2u)

/** \brief 7B4, Read Data and Bit Flip Register 42 */
#define MTU_MC7_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B4u)

/** \brief 7B6, Read Data and Bit Flip Register 43 */
#define MTU_MC7_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B6u)

/** \brief 7B8, Read Data and Bit Flip Register 44 */
#define MTU_MC7_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B8u)

/** \brief 7BA, Read Data and Bit Flip Register 45 */
#define MTU_MC7_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BAu)

/** \brief 7BC, Read Data and Bit Flip Register 46 */
#define MTU_MC7_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BCu)

/** \brief 7BE, Read Data and Bit Flip Register 47 */
#define MTU_MC7_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BEu)

/** \brief 7C0, Read Data and Bit Flip Register 48 */
#define MTU_MC7_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C0u)

/** \brief 7C2, Read Data and Bit Flip Register 49 */
#define MTU_MC7_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C2u)

/** \brief 7C4, Read Data and Bit Flip Register 50 */
#define MTU_MC7_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C4u)

/** \brief 7C6, Read Data and Bit Flip Register 51 */
#define MTU_MC7_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C6u)

/** \brief 7C8, Read Data and Bit Flip Register 52 */
#define MTU_MC7_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C8u)

/** \brief 7CA, Read Data and Bit Flip Register 53 */
#define MTU_MC7_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CAu)

