veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 2314, Error Tracking Register 1 */
#define MTU_MC35_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063314u)

/** \brief 2316, Error Tracking Register 2 */
#define MTU_MC35_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063316u)

/** \brief 2318, Error Tracking Register 3 */
#define MTU_MC35_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063318u)

/** \brief 231A, Error Tracking Register 4 */
#define MTU_MC35_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006331Au)

/** \brief 2360, Read Data and Bit Flip Register 0 */
#define MTU_MC35_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063360u)

/** \brief 2362, Read Data and Bit Flip Register 1 */
#define MTU_MC35_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063362u)

/** \brief 2364, Read Data and Bit Flip Register 2 */
#define MTU_MC35_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063364u)

/** \brief 2366, Read Data and Bit Flip Register 3 */
#define MTU_MC35_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063366u)

/** \brief 2368, Read Data and Bit Flip Register 4 */
#define MTU_MC35_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063368u)

/** \brief 236A, Read Data and Bit Flip Register 5 */
#define MTU_MC35_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Au)

/** \brief 236C, Read Data and Bit Flip Register 6 */
#define MTU_MC35_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Cu)

/** \brief 236E, Read Data and Bit Flip Register 7 */
#define MTU_MC35_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006336Eu)

/** \brief 2370, Read Data and Bit Flip Register 8 */
#define MTU_MC35_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063370u)

/** \brief 2372, Read Data and Bit Flip Register 9 */
#define MTU_MC35_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063372u)

/** \brief 2374, Read Data and Bit Flip Register 10 */
#define MTU_MC35_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063374u)

/** \brief 2376, Read Data and Bit Flip Register 11 */
#define MTU_MC35_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063376u)

/** \brief 2378, Read Data and Bit Flip Register 12 */
#define MTU_MC35_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063378u)

/** \brief 237A, Read Data and Bit Flip Register 13 */
#define MTU_MC35_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Au)

/** \brief 237C, Read Data and Bit Flip Register 14 */
#define MTU_MC35_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Cu)

/** \brief 237E, Read Data and Bit Flip Register 15 */
#define MTU_MC35_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006337Eu)

/** \brief 2380, Read Data and Bit Flip Register 16 */
#define MTU_MC35_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063380u)

/** \brief 2382, Read Data and Bit Flip Register 17 */
#define MTU_MC35_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063382u)

/** \brief 2384, Read Data and Bit Flip Register 18 */
#define MTU_MC35_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063384u)

/** \brief 2386, Read Data and Bit Flip Register 19 */
#define MTU_MC35_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063386u)

/** \brief 2388, Read Data and Bit Flip Register 20 */
#define MTU_MC35_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063388u)

/** \brief 238A, Read Data and Bit Flip Register 21 */
#define MTU_MC35_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Au)

/** \brief 238C, Read Data and Bit Flip Register 22 */
#define MTU_MC35_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Cu)

/** \brief 238E, Read Data and Bit Flip Register 23 */
#define MTU_MC35_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006338Eu)

/** \brief 2390, Read Data and Bit Flip Register 24 */
#define MTU_MC35_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063390u)

/** \brief 2392, Read Data and Bit Flip Register 25 */
#define MTU_MC35_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063392u)

/** \brief 2394, Read Data and Bit Flip Register 26 */
#define MTU_MC35_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063394u)

/** \brief 2396, Read Data and Bit Flip Register 27 */
#define MTU_MC35_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063396u)

/** \brief 2398, Read Data and Bit Flip Register 28 */
#define MTU_MC35_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063398u)

/** \brief 239A, Read Data and Bit Flip Register 29 */
#define MTU_MC35_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Au)

/** \brief 239C, Read Data and Bit Flip Register 30 */
#define MTU_MC35_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Cu)

/** \brief 239E, Read Data and Bit Flip Register 31 */
#define MTU_MC35_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006339Eu)

/** \brief 23A0, Read Data and Bit Flip Register 32 */
#define MTU_MC35_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A0u)

/** \brief 23A2, Read Data and Bit Flip Register 33 */
#define MTU_MC35_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A2u)

/** \brief 23A4, Read Data and Bit Flip Register 34 */
#define MTU_MC35_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A4u)

/** \brief 23A6, Read Data and Bit Flip Register 35 */
#define MTU_MC35_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A6u)

/** \brief 23A8, Read Data and Bit Flip Register 36 */
#define MTU_MC35_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633A8u)

/** \brief 23AA, Read Data and Bit Flip Register 37 */
#define MTU_MC35_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633AAu)

/** \brief 23AC, Read Data and Bit Flip Register 38 */
#define MTU_MC35_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633ACu)

/** \brief 23AE, Read Data and Bit Flip Register 39 */
#define MTU_MC35_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633AEu)

/** \brief 23B0, Read Data and Bit Flip Register 40 */
#define MTU_MC35_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B0u)

/** \brief 23B2, Read Data and Bit Flip Register 41 */
#define MTU_MC35_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B2u)

/** \brief 23B4, Read Data and Bit Flip Register 42 */
#define MTU_MC35_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B4u)

/** \brief 23B6, Read Data and Bit Flip Register 43 */
#define MTU_MC35_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B6u)

/** \brief 23B8, Read Data and Bit Flip Register 44 */
#define MTU_MC35_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633B8u)

/** \brief 23BA, Read Data and Bit Flip Register 45 */
#define MTU_MC35_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BAu)

/** \brief 23BC, Read Data and Bit Flip Register 46 */
#define MTU_MC35_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BCu)

/** \brief 23BE, Read Data and Bit Flip Register 47 */
#define MTU_MC35_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633BEu)

/** \brief 23C0, Read Data and Bit Flip Register 48 */
#define MTU_MC35_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C0u)

/** \brief 23C2, Read Data and Bit Flip Register 49 */
#define MTU_MC35_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C2u)

/** \brief 23C4, Read Data and Bit Flip Register 50 */
#define MTU_MC35_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C4u)

/** \brief 23C6, Read Data and Bit Flip Register 51 */
#define MTU_MC35_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C6u)

/** \brief 23C8, Read Data and Bit Flip Register 52 */
#define MTU_MC35_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633C8u)

/** \brief 23CA, Read Data and Bit Flip Register 53 */
#define MTU_MC35_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CAu)

