veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 23CC, Read Data and Bit Flip Register 54 */
#define MTU_MC35_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CCu)

/** \brief 23CE, Read Data and Bit Flip Register 55 */
#define MTU_MC35_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633CEu)

/** \brief 23D0, Read Data and Bit Flip Register 56 */
#define MTU_MC35_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D0u)

/** \brief 23D2, Read Data and Bit Flip Register 57 */
#define MTU_MC35_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D2u)

/** \brief 23D4, Read Data and Bit Flip Register 58 */
#define MTU_MC35_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D4u)

/** \brief 23D6, Read Data and Bit Flip Register 59 */
#define MTU_MC35_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D6u)

/** \brief 23D8, Read Data and Bit Flip Register 60 */
#define MTU_MC35_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633D8u)

/** \brief 23DA, Read Data and Bit Flip Register 61 */
#define MTU_MC35_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DAu)

/** \brief 23DC, Read Data and Bit Flip Register 62 */
#define MTU_MC35_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DCu)

/** \brief 23DE, Read Data and Bit Flip Register 63 */
#define MTU_MC35_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633DEu)

/** \brief 23E0, Read Data and Bit Flip Register 64 */
#define MTU_MC35_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E0u)

/** \brief 23E2, Read Data and Bit Flip Register 65 */
#define MTU_MC35_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E2u)

/** \brief 23E4, Read Data and Bit Flip Register 66 */
#define MTU_MC35_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00633E4u)

/** \brief 23EE, Alarm Sources Configuration Register */
#define MTU_MC35_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00633EEu)

/** \brief 23F0, SSH Safety Faults Status Register  */
#define MTU_MC35_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00633F0u)

/** \brief 23F2, Error Information Register 0 */
#define MTU_MC35_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F2u)

/** \brief 23F4, Error Information Register 1 */
#define MTU_MC35_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F4u)

/** \brief 23F6, Error Information Register 2 */
#define MTU_MC35_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F6u)

/** \brief 23F8, Error Information Register 3 */
#define MTU_MC35_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633F8u)

/** \brief 23FA, Error Information Register 4 */
#define MTU_MC35_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00633FAu)

/** \brief 2400, Configuration Registers */
#define MTU_MC36_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063400u)

/** \brief 2402, Configuration Register 1 */
#define MTU_MC36_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063402u)

/** \brief 2404, MBIST Control Register */
#define MTU_MC36_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063404u)

/** \brief 2406, Status Register */
#define MTU_MC36_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063406u)

/** \brief 2408, Range Register, single address mode */
#define MTU_MC36_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063408u)

/** \brief 240C, Revision ID Register */
#define MTU_MC36_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006340Cu)

/** \brief 240E, ECC Safety Register */
#define MTU_MC36_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006340Eu)

/** \brief 2410, Memory ECC Detection Register */
#define MTU_MC36_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063410u)

/** \brief 2412, Error Tracking Register 0 */
#define MTU_MC36_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063412u)

/** \brief 2414, Error Tracking Register 1 */
#define MTU_MC36_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063414u)

/** \brief 2416, Error Tracking Register 2 */
#define MTU_MC36_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063416u)

/** \brief 2418, Error Tracking Register 3 */
#define MTU_MC36_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063418u)

/** \brief 241A, Error Tracking Register 4 */
#define MTU_MC36_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006341Au)

/** \brief 2460, Read Data and Bit Flip Register 0 */
#define MTU_MC36_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063460u)

/** \brief 2462, Read Data and Bit Flip Register 1 */
#define MTU_MC36_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063462u)

/** \brief 2464, Read Data and Bit Flip Register 2 */
#define MTU_MC36_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063464u)

/** \brief 2466, Read Data and Bit Flip Register 3 */
#define MTU_MC36_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063466u)

/** \brief 2468, Read Data and Bit Flip Register 4 */
#define MTU_MC36_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063468u)

/** \brief 246A, Read Data and Bit Flip Register 5 */
#define MTU_MC36_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Au)

/** \brief 246C, Read Data and Bit Flip Register 6 */
#define MTU_MC36_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Cu)

/** \brief 246E, Read Data and Bit Flip Register 7 */
#define MTU_MC36_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006346Eu)

/** \brief 2470, Read Data and Bit Flip Register 8 */
#define MTU_MC36_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063470u)

/** \brief 2472, Read Data and Bit Flip Register 9 */
#define MTU_MC36_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063472u)

/** \brief 2474, Read Data and Bit Flip Register 10 */
#define MTU_MC36_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063474u)

