veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 306C, Read Data and Bit Flip Register 6 */
#define MTU_MC48_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Cu)

/** \brief 306E, Read Data and Bit Flip Register 7 */
#define MTU_MC48_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006406Eu)

/** \brief 3070, Read Data and Bit Flip Register 8 */
#define MTU_MC48_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064070u)

/** \brief 3072, Read Data and Bit Flip Register 9 */
#define MTU_MC48_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064072u)

/** \brief 3074, Read Data and Bit Flip Register 10 */
#define MTU_MC48_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064074u)

/** \brief 3076, Read Data and Bit Flip Register 11 */
#define MTU_MC48_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064076u)

/** \brief 3078, Read Data and Bit Flip Register 12 */
#define MTU_MC48_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064078u)

/** \brief 307A, Read Data and Bit Flip Register 13 */
#define MTU_MC48_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Au)

/** \brief 307C, Read Data and Bit Flip Register 14 */
#define MTU_MC48_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Cu)

/** \brief 307E, Read Data and Bit Flip Register 15 */
#define MTU_MC48_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006407Eu)

/** \brief 3080, Read Data and Bit Flip Register 16 */
#define MTU_MC48_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064080u)

/** \brief 3082, Read Data and Bit Flip Register 17 */
#define MTU_MC48_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064082u)

/** \brief 3084, Read Data and Bit Flip Register 18 */
#define MTU_MC48_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064084u)

/** \brief 3086, Read Data and Bit Flip Register 19 */
#define MTU_MC48_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064086u)

/** \brief 3088, Read Data and Bit Flip Register 20 */
#define MTU_MC48_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064088u)

/** \brief 308A, Read Data and Bit Flip Register 21 */
#define MTU_MC48_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Au)

/** \brief 308C, Read Data and Bit Flip Register 22 */
#define MTU_MC48_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Cu)

/** \brief 308E, Read Data and Bit Flip Register 23 */
#define MTU_MC48_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006408Eu)

/** \brief 3090, Read Data and Bit Flip Register 24 */
#define MTU_MC48_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064090u)

/** \brief 3092, Read Data and Bit Flip Register 25 */
#define MTU_MC48_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064092u)

/** \brief 3094, Read Data and Bit Flip Register 26 */
#define MTU_MC48_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064094u)

/** \brief 3096, Read Data and Bit Flip Register 27 */
#define MTU_MC48_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064096u)

/** \brief 3098, Read Data and Bit Flip Register 28 */
#define MTU_MC48_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064098u)

/** \brief 309A, Read Data and Bit Flip Register 29 */
#define MTU_MC48_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Au)

/** \brief 309C, Read Data and Bit Flip Register 30 */
#define MTU_MC48_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Cu)

/** \brief 309E, Read Data and Bit Flip Register 31 */
#define MTU_MC48_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006409Eu)

/** \brief 30A0, Read Data and Bit Flip Register 32 */
#define MTU_MC48_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A0u)

/** \brief 30A2, Read Data and Bit Flip Register 33 */
#define MTU_MC48_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A2u)

/** \brief 30A4, Read Data and Bit Flip Register 34 */
#define MTU_MC48_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A4u)

/** \brief 30A6, Read Data and Bit Flip Register 35 */
#define MTU_MC48_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A6u)

/** \brief 30A8, Read Data and Bit Flip Register 36 */
#define MTU_MC48_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640A8u)

/** \brief 30AA, Read Data and Bit Flip Register 37 */
#define MTU_MC48_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640AAu)

/** \brief 30AC, Read Data and Bit Flip Register 38 */
#define MTU_MC48_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640ACu)

/** \brief 30AE, Read Data and Bit Flip Register 39 */
#define MTU_MC48_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640AEu)

/** \brief 30B0, Read Data and Bit Flip Register 40 */
#define MTU_MC48_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B0u)

/** \brief 30B2, Read Data and Bit Flip Register 41 */
#define MTU_MC48_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B2u)

/** \brief 30B4, Read Data and Bit Flip Register 42 */
#define MTU_MC48_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B4u)

/** \brief 30B6, Read Data and Bit Flip Register 43 */
#define MTU_MC48_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B6u)

/** \brief 30B8, Read Data and Bit Flip Register 44 */
#define MTU_MC48_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640B8u)

/** \brief 30BA, Read Data and Bit Flip Register 45 */
#define MTU_MC48_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BAu)

/** \brief 30BC, Read Data and Bit Flip Register 46 */
#define MTU_MC48_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BCu)

/** \brief 30BE, Read Data and Bit Flip Register 47 */
#define MTU_MC48_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640BEu)

/** \brief 30C0, Read Data and Bit Flip Register 48 */
#define MTU_MC48_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C0u)

/** \brief 30C2, Read Data and Bit Flip Register 49 */
#define MTU_MC48_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C2u)

/** \brief 30C4, Read Data and Bit Flip Register 50 */
#define MTU_MC48_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C4u)

/** \brief 30C6, Read Data and Bit Flip Register 51 */
#define MTU_MC48_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C6u)

/** \brief 30C8, Read Data and Bit Flip Register 52 */
#define MTU_MC48_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640C8u)

/** \brief 30CA, Read Data and Bit Flip Register 53 */
#define MTU_MC48_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00640CAu)

