veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 3278, Read Data and Bit Flip Register 12 */
#define MTU_MC50_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064278u)

/** \brief 327A, Read Data and Bit Flip Register 13 */
#define MTU_MC50_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Au)

/** \brief 327C, Read Data and Bit Flip Register 14 */
#define MTU_MC50_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Cu)

/** \brief 327E, Read Data and Bit Flip Register 15 */
#define MTU_MC50_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006427Eu)

/** \brief 3280, Read Data and Bit Flip Register 16 */
#define MTU_MC50_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064280u)

/** \brief 3282, Read Data and Bit Flip Register 17 */
#define MTU_MC50_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064282u)

/** \brief 3284, Read Data and Bit Flip Register 18 */
#define MTU_MC50_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064284u)

/** \brief 3286, Read Data and Bit Flip Register 19 */
#define MTU_MC50_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064286u)

/** \brief 3288, Read Data and Bit Flip Register 20 */
#define MTU_MC50_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064288u)

/** \brief 328A, Read Data and Bit Flip Register 21 */
#define MTU_MC50_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Au)

/** \brief 328C, Read Data and Bit Flip Register 22 */
#define MTU_MC50_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Cu)

/** \brief 328E, Read Data and Bit Flip Register 23 */
#define MTU_MC50_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006428Eu)

/** \brief 3290, Read Data and Bit Flip Register 24 */
#define MTU_MC50_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064290u)

/** \brief 3292, Read Data and Bit Flip Register 25 */
#define MTU_MC50_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064292u)

/** \brief 3294, Read Data and Bit Flip Register 26 */
#define MTU_MC50_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064294u)

/** \brief 3296, Read Data and Bit Flip Register 27 */
#define MTU_MC50_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064296u)

/** \brief 3298, Read Data and Bit Flip Register 28 */
#define MTU_MC50_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064298u)

/** \brief 329A, Read Data and Bit Flip Register 29 */
#define MTU_MC50_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Au)

/** \brief 329C, Read Data and Bit Flip Register 30 */
#define MTU_MC50_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Cu)

/** \brief 329E, Read Data and Bit Flip Register 31 */
#define MTU_MC50_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006429Eu)

/** \brief 32A0, Read Data and Bit Flip Register 32 */
#define MTU_MC50_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A0u)

/** \brief 32A2, Read Data and Bit Flip Register 33 */
#define MTU_MC50_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A2u)

/** \brief 32A4, Read Data and Bit Flip Register 34 */
#define MTU_MC50_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A4u)

/** \brief 32A6, Read Data and Bit Flip Register 35 */
#define MTU_MC50_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A6u)

/** \brief 32A8, Read Data and Bit Flip Register 36 */
#define MTU_MC50_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642A8u)

/** \brief 32AA, Read Data and Bit Flip Register 37 */
#define MTU_MC50_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642AAu)

/** \brief 32AC, Read Data and Bit Flip Register 38 */
#define MTU_MC50_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642ACu)

/** \brief 32AE, Read Data and Bit Flip Register 39 */
#define MTU_MC50_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642AEu)

/** \brief 32B0, Read Data and Bit Flip Register 40 */
#define MTU_MC50_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B0u)

/** \brief 32B2, Read Data and Bit Flip Register 41 */
#define MTU_MC50_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B2u)

/** \brief 32B4, Read Data and Bit Flip Register 42 */
#define MTU_MC50_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B4u)

/** \brief 32B6, Read Data and Bit Flip Register 43 */
#define MTU_MC50_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B6u)

/** \brief 32B8, Read Data and Bit Flip Register 44 */
#define MTU_MC50_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642B8u)

/** \brief 32BA, Read Data and Bit Flip Register 45 */
#define MTU_MC50_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BAu)

/** \brief 32BC, Read Data and Bit Flip Register 46 */
#define MTU_MC50_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BCu)

/** \brief 32BE, Read Data and Bit Flip Register 47 */
#define MTU_MC50_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642BEu)

/** \brief 32C0, Read Data and Bit Flip Register 48 */
#define MTU_MC50_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C0u)

/** \brief 32C2, Read Data and Bit Flip Register 49 */
#define MTU_MC50_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C2u)

/** \brief 32C4, Read Data and Bit Flip Register 50 */
#define MTU_MC50_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C4u)

/** \brief 32C6, Read Data and Bit Flip Register 51 */
#define MTU_MC50_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C6u)

/** \brief 32C8, Read Data and Bit Flip Register 52 */
#define MTU_MC50_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642C8u)

/** \brief 32CA, Read Data and Bit Flip Register 53 */
#define MTU_MC50_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CAu)

/** \brief 32CC, Read Data and Bit Flip Register 54 */
#define MTU_MC50_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CCu)

