veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 3B72, Read Data and Bit Flip Register 9 */
#define MTU_MC59_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B72u)

/** \brief 3B74, Read Data and Bit Flip Register 10 */
#define MTU_MC59_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B74u)

/** \brief 3B76, Read Data and Bit Flip Register 11 */
#define MTU_MC59_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B76u)

/** \brief 3B78, Read Data and Bit Flip Register 12 */
#define MTU_MC59_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B78u)

/** \brief 3B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC59_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Au)

/** \brief 3B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC59_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Cu)

/** \brief 3B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC59_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B7Eu)

/** \brief 3B80, Read Data and Bit Flip Register 16 */
#define MTU_MC59_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B80u)

/** \brief 3B82, Read Data and Bit Flip Register 17 */
#define MTU_MC59_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B82u)

/** \brief 3B84, Read Data and Bit Flip Register 18 */
#define MTU_MC59_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B84u)

/** \brief 3B86, Read Data and Bit Flip Register 19 */
#define MTU_MC59_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B86u)

/** \brief 3B88, Read Data and Bit Flip Register 20 */
#define MTU_MC59_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B88u)

/** \brief 3B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC59_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Au)

/** \brief 3B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC59_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Cu)

/** \brief 3B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC59_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B8Eu)

/** \brief 3B90, Read Data and Bit Flip Register 24 */
#define MTU_MC59_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B90u)

/** \brief 3B92, Read Data and Bit Flip Register 25 */
#define MTU_MC59_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B92u)

/** \brief 3B94, Read Data and Bit Flip Register 26 */
#define MTU_MC59_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B94u)

/** \brief 3B96, Read Data and Bit Flip Register 27 */
#define MTU_MC59_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B96u)

/** \brief 3B98, Read Data and Bit Flip Register 28 */
#define MTU_MC59_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B98u)

/** \brief 3B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC59_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Au)

/** \brief 3B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC59_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Cu)

/** \brief 3B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC59_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B9Eu)

/** \brief 3BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC59_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA0u)

/** \brief 3BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC59_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA2u)

/** \brief 3BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC59_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA4u)

/** \brief 3BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC59_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA6u)

/** \brief 3BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC59_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BA8u)

/** \brief 3BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC59_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BAAu)

/** \brief 3BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC59_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BACu)

/** \brief 3BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC59_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BAEu)

/** \brief 3BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC59_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB0u)

/** \brief 3BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC59_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB2u)

/** \brief 3BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC59_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB4u)

/** \brief 3BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC59_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB6u)

/** \brief 3BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC59_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BB8u)

/** \brief 3BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC59_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBAu)

/** \brief 3BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC59_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBCu)

/** \brief 3BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC59_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BBEu)

/** \brief 3BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC59_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC0u)

/** \brief 3BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC59_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC2u)

/** \brief 3BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC59_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064BC4u)

