veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 5366, Read Data and Bit Flip Register 3 */
#define MTU_MC83_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066366u)

/** \brief 5368, Read Data and Bit Flip Register 4 */
#define MTU_MC83_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066368u)

/** \brief 536A, Read Data and Bit Flip Register 5 */
#define MTU_MC83_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Au)

/** \brief 536C, Read Data and Bit Flip Register 6 */
#define MTU_MC83_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Cu)

/** \brief 536E, Read Data and Bit Flip Register 7 */
#define MTU_MC83_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006636Eu)

/** \brief 5370, Read Data and Bit Flip Register 8 */
#define MTU_MC83_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066370u)

/** \brief 5372, Read Data and Bit Flip Register 9 */
#define MTU_MC83_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066372u)

/** \brief 5374, Read Data and Bit Flip Register 10 */
#define MTU_MC83_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066374u)

/** \brief 5376, Read Data and Bit Flip Register 11 */
#define MTU_MC83_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066376u)

/** \brief 5378, Read Data and Bit Flip Register 12 */
#define MTU_MC83_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066378u)

/** \brief 537A, Read Data and Bit Flip Register 13 */
#define MTU_MC83_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Au)

/** \brief 537C, Read Data and Bit Flip Register 14 */
#define MTU_MC83_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Cu)

/** \brief 537E, Read Data and Bit Flip Register 15 */
#define MTU_MC83_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006637Eu)

/** \brief 5380, Read Data and Bit Flip Register 16 */
#define MTU_MC83_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066380u)

/** \brief 5382, Read Data and Bit Flip Register 17 */
#define MTU_MC83_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066382u)

/** \brief 5384, Read Data and Bit Flip Register 18 */
#define MTU_MC83_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066384u)

/** \brief 5386, Read Data and Bit Flip Register 19 */
#define MTU_MC83_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066386u)

/** \brief 5388, Read Data and Bit Flip Register 20 */
#define MTU_MC83_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066388u)

/** \brief 538A, Read Data and Bit Flip Register 21 */
#define MTU_MC83_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Au)

/** \brief 538C, Read Data and Bit Flip Register 22 */
#define MTU_MC83_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Cu)

/** \brief 538E, Read Data and Bit Flip Register 23 */
#define MTU_MC83_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006638Eu)

/** \brief 5390, Read Data and Bit Flip Register 24 */
#define MTU_MC83_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066390u)

/** \brief 5392, Read Data and Bit Flip Register 25 */
#define MTU_MC83_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066392u)

/** \brief 5394, Read Data and Bit Flip Register 26 */
#define MTU_MC83_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066394u)

/** \brief 5396, Read Data and Bit Flip Register 27 */
#define MTU_MC83_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066396u)

/** \brief 5398, Read Data and Bit Flip Register 28 */
#define MTU_MC83_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066398u)

/** \brief 539A, Read Data and Bit Flip Register 29 */
#define MTU_MC83_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Au)

/** \brief 539C, Read Data and Bit Flip Register 30 */
#define MTU_MC83_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Cu)

/** \brief 539E, Read Data and Bit Flip Register 31 */
#define MTU_MC83_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006639Eu)

/** \brief 53A0, Read Data and Bit Flip Register 32 */
#define MTU_MC83_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A0u)

/** \brief 53A2, Read Data and Bit Flip Register 33 */
#define MTU_MC83_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A2u)

/** \brief 53A4, Read Data and Bit Flip Register 34 */
#define MTU_MC83_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A4u)

/** \brief 53A6, Read Data and Bit Flip Register 35 */
#define MTU_MC83_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A6u)

/** \brief 53A8, Read Data and Bit Flip Register 36 */
#define MTU_MC83_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663A8u)

/** \brief 53AA, Read Data and Bit Flip Register 37 */
#define MTU_MC83_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663AAu)

/** \brief 53AC, Read Data and Bit Flip Register 38 */
#define MTU_MC83_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663ACu)

/** \brief 53AE, Read Data and Bit Flip Register 39 */
#define MTU_MC83_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663AEu)

/** \brief 53B0, Read Data and Bit Flip Register 40 */
#define MTU_MC83_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B0u)

/** \brief 53B2, Read Data and Bit Flip Register 41 */
#define MTU_MC83_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B2u)

/** \brief 53B4, Read Data and Bit Flip Register 42 */
#define MTU_MC83_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B4u)

/** \brief 53B6, Read Data and Bit Flip Register 43 */
#define MTU_MC83_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B6u)

/** \brief 53B8, Read Data and Bit Flip Register 44 */
#define MTU_MC83_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663B8u)

/** \brief 53BA, Read Data and Bit Flip Register 45 */
#define MTU_MC83_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BAu)

/** \brief 53BC, Read Data and Bit Flip Register 46 */
#define MTU_MC83_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BCu)

/** \brief 53BE, Read Data and Bit Flip Register 47 */
#define MTU_MC83_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663BEu)

/** \brief 53C0, Read Data and Bit Flip Register 48 */
#define MTU_MC83_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C0u)

/** \brief 53C2, Read Data and Bit Flip Register 49 */
#define MTU_MC83_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C2u)

/** \brief 53C4, Read Data and Bit Flip Register 50 */
#define MTU_MC83_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C4u)

/** \brief 53C6, Read Data and Bit Flip Register 51 */
#define MTU_MC83_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C6u)

/** \brief 53C8, Read Data and Bit Flip Register 52 */
#define MTU_MC83_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663C8u)

/** \brief 53CA, Read Data and Bit Flip Register 53 */
#define MTU_MC83_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CAu)

