veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxMtu_reg.h
/** \brief 55C8, Read Data and Bit Flip Register 52 */
#define MTU_MC85_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C8u)

/** \brief 55CA, Read Data and Bit Flip Register 53 */
#define MTU_MC85_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CAu)

/** \brief 55CC, Read Data and Bit Flip Register 54 */
#define MTU_MC85_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CCu)

/** \brief 55CE, Read Data and Bit Flip Register 55 */
#define MTU_MC85_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665CEu)

/** \brief 55D0, Read Data and Bit Flip Register 56 */
#define MTU_MC85_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D0u)

/** \brief 55D2, Read Data and Bit Flip Register 57 */
#define MTU_MC85_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D2u)

/** \brief 55D4, Read Data and Bit Flip Register 58 */
#define MTU_MC85_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D4u)

/** \brief 55D6, Read Data and Bit Flip Register 59 */
#define MTU_MC85_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D6u)

/** \brief 55D8, Read Data and Bit Flip Register 60 */
#define MTU_MC85_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665D8u)

/** \brief 55DA, Read Data and Bit Flip Register 61 */
#define MTU_MC85_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DAu)

/** \brief 55DC, Read Data and Bit Flip Register 62 */
#define MTU_MC85_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DCu)

/** \brief 55DE, Read Data and Bit Flip Register 63 */
#define MTU_MC85_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665DEu)

/** \brief 55E0, Read Data and Bit Flip Register 64 */
#define MTU_MC85_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E0u)

/** \brief 55E2, Read Data and Bit Flip Register 65 */
#define MTU_MC85_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E2u)

/** \brief 55E4, Read Data and Bit Flip Register 66 */
#define MTU_MC85_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665E4u)

/** \brief 55EE, Alarm Sources Configuration Register */
#define MTU_MC85_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00665EEu)

/** \brief 55F0, SSH Safety Faults Status Register  */
#define MTU_MC85_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00665F0u)

/** \brief 55F2, Error Information Register 0 */
#define MTU_MC85_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F2u)

/** \brief 55F4, Error Information Register 1 */
#define MTU_MC85_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F4u)

/** \brief 55F6, Error Information Register 2 */
#define MTU_MC85_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F6u)

/** \brief 55F8, Error Information Register 3 */
#define MTU_MC85_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665F8u)

/** \brief 55FA, Error Information Register 4 */
#define MTU_MC85_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00665FAu)

/** \brief 5600, Configuration Registers */
#define MTU_MC86_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066600u)

/** \brief 5602, Configuration Register 1 */
#define MTU_MC86_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066602u)

/** \brief 5604, MBIST Control Register */
#define MTU_MC86_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066604u)

/** \brief 5606, Status Register */
#define MTU_MC86_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066606u)

/** \brief 5608, Range Register, single address mode */
#define MTU_MC86_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066608u)

/** \brief 560C, Revision ID Register */
#define MTU_MC86_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006660Cu)

/** \brief 560E, ECC Safety Register */
#define MTU_MC86_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006660Eu)

/** \brief 5610, Memory ECC Detection Register */
#define MTU_MC86_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066610u)

/** \brief 5612, Error Tracking Register 0 */
#define MTU_MC86_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066612u)

/** \brief 5614, Error Tracking Register 1 */
#define MTU_MC86_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066614u)

/** \brief 5616, Error Tracking Register 2 */
#define MTU_MC86_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066616u)

/** \brief 5618, Error Tracking Register 3 */
#define MTU_MC86_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066618u)

/** \brief 561A, Error Tracking Register 4 */
#define MTU_MC86_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006661Au)

/** \brief 5660, Read Data and Bit Flip Register 0 */
#define MTU_MC86_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066660u)

/** \brief 5662, Read Data and Bit Flip Register 1 */
#define MTU_MC86_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066662u)

/** \brief 5664, Read Data and Bit Flip Register 2 */
#define MTU_MC86_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066664u)

/** \brief 5666, Read Data and Bit Flip Register 3 */
#define MTU_MC86_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066666u)

/** \brief 5668, Read Data and Bit Flip Register 4 */
#define MTU_MC86_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066668u)

/** \brief 566A, Read Data and Bit Flip Register 5 */
#define MTU_MC86_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Au)

/** \brief 566C, Read Data and Bit Flip Register 6 */
#define MTU_MC86_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Cu)

/** \brief 566E, Read Data and Bit Flip Register 7 */
#define MTU_MC86_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006666Eu)

/** \brief 5670, Read Data and Bit Flip Register 8 */
#define MTU_MC86_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066670u)

/** \brief 5672, Read Data and Bit Flip Register 9 */
#define MTU_MC86_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066672u)

/** \brief 5674, Read Data and Bit Flip Register 10 */
#define MTU_MC86_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066674u)

/** \brief 5676, Read Data and Bit Flip Register 11 */
#define MTU_MC86_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066676u)

